---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepTrussJoined
source: html/fd97ac9d-f94f-5fb0-2c33-415aaabf0de8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepTrussJoined Property

Can't keep the highlighted [Element]s joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepTrussJoined { get; }
```